<a href="https://colab.research.google.com/github/nighteye2/machine-learning-notes/blob/main/sql_n_sqlite.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **SQL and SQLite**

---
sql (structured query language) is a standard language for managing and manipulating relational databases. sqlite is self contained, serverless and zero configuration database engine that is widely used for embedded database systems.

In [19]:
import sqlite3
connection = sqlite3.connect('example.db')
connection

In [20]:
cursor = connection.cursor()

In [26]:
#create a table
cursor.execute('''
CREATE TABLE IF NOT EXISTS Employees(
  Id INTEGER PRIMARY KEY,
  Name TEXT NOT NULL,
  Age INTEGER NOT NULL,
  Department TEXT NOT NULL
  )
''')
#commit the changes
connection.commit()

In [27]:
cursor.execute('''
SELECT * FROM Employees

''')

In [28]:
cursor.execute('''
INSERT INTO Employees(Name,Age,Department)
VALUES('RAAJ',20,'ARTIFICIAL INTELLIGENCE')
''')

cursor.execute('''
INSERT INTO Employees(Name,Age,Department)
VALUES('DHIRAJ',21,'ARTIFICIAL INTELLIGENCE')
''')

cursor.execute('''
INSERT INTO Employees(Name,Age,Department)
VALUES('KEDAR',21,'ARTIFICIAL INTELLIGENCE')
''')

#commit the changes
connection.commit()

In [29]:
#query the data from the table
cursor.execute('SELECT * FROM Employees')
rows=cursor.fetchall() #fetches all the records from the table
for row in rows:
  print(row)

(1, 'RAAJ', 20, 'ARTIFICIAL INTELLIGENCE')
(2, 'DHIRAJ', 21, 'ARTIFICIAL INTELLIGENCE')
(3, 'KEDAR', 21, 'ARTIFICIAL INTELLIGENCE')

In [30]:
#update the data in the table
cursor.execute('''
UPDATE Employees
SET Age=22
WHERE Name='DHIRAJ'
''')
#commit the changes
connection.commit()

In [31]:
#delete the data from the table
cursor.execute('''
DELETE FROM Employees
WHERE Name='KEDAR'
''')
connection.commit()

In [32]:
cursor.execute('SELECT * FROM Employees')
rows= cursor.fetchall()

for row in rows:
  print(row)

(1, 'RAAJ', 20, 'ARTIFICIAL INTELLIGENCE')
(2, 'DHIRAJ', 22, 'ARTIFICIAL INTELLIGENCE')

In [33]:
#multiple insertion of data
employee_data = [
    ('ANUJ',21,'ARTIFICIAL INTELLIGENCE'),
    ('ABHIJEET',20,'ARTIFICIAL INTELLIGENCE'),
    ('BHUMIKA',22,'ARTIFICIAL INTELLIGENCE')
]
cursor.executemany('''
INSERT INTO Employees(Name,Age,Department)
VALUES(?,?,?)
''',employee_data)
connection.commit()

In [52]:
cursor.execute('SELECT * FROM Employees')
rows = cursor.fetchall()
for row in rows:
  print(row)

(1, 'RAAJ', 20, 'ARTIFICIAL INTELLIGENCE')
(2, 'DHIRAJ', 22, 'ARTIFICIAL INTELLIGENCE')
(3, 'ANUJ', 21, 'ARTIFICIAL INTELLIGENCE')
(4, 'ABHIJEET', 20, 'ARTIFICIAL INTELLIGENCE')
(5, 'BHUMIKA', 22, 'ARTIFICIAL INTELLIGENCE')
(6, 'SANJANA', 23, 'COMPUTER SCIENCE')
(7, 'FARHAAN', 20, 'COMPUTER SCIENCE')

In [ ]:
#now if you try to execute cursor.execute() it will not be executed as connection is closed.

In [58]:
import pandas as pd
import sqlite3

# Establish a connection to the database
connection = sqlite3.connect('example.db')  # Replace with your database file

# Define the SQL query
query = "SELECT * FROM Employees"  # Replace with your table name

# Read the table into a DataFrame
df = pd.read_sql_query(query, connection)


# Display the DataFrame
print(df)

   Id      Name  Age               Department
0   1      RAAJ   20  ARTIFICIAL INTELLIGENCE
1   2    DHIRAJ   22  ARTIFICIAL INTELLIGENCE
2   3      ANUJ   21  ARTIFICIAL INTELLIGENCE
3   4  ABHIJEET   20  ARTIFICIAL INTELLIGENCE
4   5   BHUMIKA   22  ARTIFICIAL INTELLIGENCE

In [44]:
cursor.execute('''
INSERT INTO Employees(Name,Age,Department)
VALUES('SANJANA',23,'COMPUTER SCIENCE')
''')

cursor.execute('''
INSERT INTO Employees(Name,Age,Department)
VALUES('FARHAAN',20,'COMPUTER SCIENCE')
''')

connection.commit()

In [51]:
department_count = employee_df.groupby('Department').size()
department_count

Department
ARTIFICIAL INTELLIGENCE    5
dtype: int64